Revit 2026 API

# LocationPoint Class

---

Provides location functionality for all elements that have a single insertion point.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBLocation Autodesk.Revit.DBLocationPoint

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LocationPoint : Location
```
```vb
Public Class LocationPoint
	Inherits Location
```
```cpp
public ref class LocationPoint : public Location
```
```fsharp
type LocationPoint =
    class
        inherit Location
    end
```

The LocationPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Point | The physical location of the element. |
|  | Rotation | The angle of rotation around the insertion point, in radians. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Move | Move the element within the project by a specified vector.(Inherited from Location) |
|  | Rotate | Rotate the element within the project by a specified angle around a given axis.(Inherited from Location) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The location point objects adds additional functionality to its base location object class. This includes setting the elements location to a specific point and retrieving its rotation around its insertion point. Inplace families do not have a single insertion point and therefore do not have meaningful LocationPoint data.

#### Reference

Autodesk.Revit.DB Namespace